#!/usr/bin/perl
#Ñïèäâîëêè è âñÿêèå ïðèñïîñîáëåíèÿ äëÿ íèõ

package Speedw;

use Common;
use Alias;

use strict;

my %edirs =
(
        "east" => "west" , "west" => "east",
        "north" => "south" , "south" => "north",
        "down" => "up", "up" => "down"
);


my %speedwalks = (
        'ðîä:êîðñà' => 'þþþþþþþâþþþþþþâââþþþâþþþþþââââñâââþþâþþþââþâââââþþâââþââââââââ',
        'ðîä:êëþ÷' =>    'þþþþþþþâþþþþþþ',
        'êëþ÷:ñêàçêà' => 'çççñââââââ',
        'êëþ÷:ïðèòîí' => 'âââþþþâþþþþþââââñâââþþâþþþââþââ',
        'ïðèòîí:êîðñà' => 'âââþþâââþââââââââ',
        'êîðñà:ðàç' => 'âââââññññâñññññçñññññâñññññçñññçññññññ',
        'êîðñà:ïîñòîÿëûé' => 'âââââññññâñññññçñññññâññññ',
	'ïîñòîÿëûé:ðàç' => 'ñçññçñññññññ',
        'êîðñà:áðîä' => 'âââââââââââñññââââþþââââââþââñâââñââââââþþâââþâââþþââñâââ',
        'áðîä:áîãèíÿ' => 'ñâââââââââþââñâââââââââññ',
        'ðàç:áîë' => 'ççññâñññññññ',
        'áîë:ñòàð' => 'ññññçññññññâââññññççññññññññññññçñ',
        'áîë:ïîëîâöû' => 'ññññçññññññâââññññççññâââââââþ',
        'ñòàð:ïîëîâöû' => 'þâþþþþþþþþþþâââââââþ',
        'ñòàð:ñòðàííàÿ' => 'ççñçñçñççñçççñçñçñçñçñçññ',
        'ñòàð:ðûáà' => 'ñññââññññçññññââñññññâññâñññññ',
        'ðûáà:ëèñ' => 'ñññññññññâ',
        'ñòðàííàÿ:äåðåâî'=>'ññññññññññññññññññççñçññççñññ',
        'äåðåâî:ñóñàíèí' => 'þþþþþçççññççññççç',
        'ãàëè÷:çàãðîá' => 'âââââñâþââñââââââââââñâââñââñââââââññâñââââââñâââñâââñâââââñââââââñââââââñââââââââññââ',
        'çàãðîá:3ä' => 'âââñâñââââââââââââââþâââââ',
        '3ä:âîðîí' => 'âþâââââââþâââþââââââââââââ',
        'âîðîí:âûáîð' => 'þâââââââââââââþâââââââþ',
        'âûáîð:ïàðîì' => 'þþþççççñçñçççþþççç',
        'âûáîð:íêçâ' => 'âââñâââââââñâââââââþââââââþâââ',
        'íê:ïðîêë' => 'ââââââââþþþþþþþþþâââââââ',
        'íê:ñòðåìíèíà' => 'ññññâññâñññññââññññññññññçñññññññçññ',
        'ñòðåìíèíà:öûãàíå' => 'çñññâññññâññññññññññññâññâññâññçñññññññññññññññññññññ',
	'öûãàíå:àíòîí' => 'ñâññññââñççñññ',
	'àíòîí:ñîëîâà' => 'âññâññññññâññññññññññññâ',
        'âûøãîðîä:÷åðíèãîâ' => 'ââññââñâñâñññâññâññââñâñâñâñññâññâññññññââñâââââââññâââââââñââââñâââââââññâñâñâñâññâñâñâñâñâñââââââñââñââââñ',
	'÷åðíèãîâ:39' => 'ññññññññññââââþâââââââââþþâþââââñââññâââþââñâââþþâââââñâñâñââââââââââþâââþâþââââââââññâââââââñâââþââââþââ',
	'39:êóðñê' => 'ââþâþââââââââââþâþâââââñââââ',
        'ñòðåìíèíà:ñòðåëû' => 'þçççççññâñññ',
        'ñòðåëû:âåòåð' => 'ñâñññçññññâññâñ',
        'âåòåð:áóíòàðêà' => 'ññññññññññññâñññññññññññññââñâ',
        'áóíòàðêà:ñòðåëû2' => 'ñâññçññññ',
        'ñòðåëû2:âèêè' => 'ñññâñâññññçñçññçñññññçññâññâññññçññâññññññçññññ',
        'âèêè:÷óäü' => 'âââââââââââñâââââþâââñâââââþâââââñâ',
        '÷óäü:âàðÿãè' => 'âþâââñâââââññññññññññññâññññçññññâñâñâññññ',
        'âàðÿãè:íàëàäîãó' => 'âââââþâââþââââñââñâñââââââþâââñ',
        'íàëàäîãó:âí' => 'ââââââââââââââþþþ',
	'äññ:âí' => 'ñññññññââââþþþ',
	'äññ:íàëàäîãó' => 'ñññññññçççççççççç',
        'íàëàäîãó:øêîëà' => 'ñññññññññññññçññçññçñññâñâñ',
	'øêîëà:çàñòàâà' => 'ñññññññññâññââââñññññçñññññççñçññññññâññññ',
	'òîòüìà:âí' => 'çççççççççççþçççççççþççççççççççççççççþççççñççþçççççççççççççççþçþçççççççççççþçþþ',
	'òîòüìà:ïðåäêè' => 'çççççççççççþçççççççþççççççççççççççççþççççñççþçççççççççççççççþçþçççççççççççþçþþ',
	'âí:ïðåäêè' => 'ññâââñâââââââââñââââââââââñâââââþââââââââââââââñâ',
	'ïðåäêè:òîòüìà' => 'âââââââñâââââââñâââââââââñâââ'
);

my %inverts = ('â' => 'ç', 'ç' => 'â' , 'ñ' => 'þ', 'þ' => 'ñ' , 'u' => 'd', 'd' => 'u');
my %einverts = ('â' => 'ç', 'ç' => 'â' , 'ñ' => 'þ', 'þ' => 'ñ' , 'u' => 'd', 'd' => 'u');
my %translate = ('â' => 'east', 'ç' => 'west' , 'ñ' => 'north', 'þ' => 'south' , 'u' => 'up', 'd' => 'down');

my $cur_pos = 0;
my @speed_array = ();
for (keys %speedwalks)
{
        my ($from,$to) = split /:/;
        my ($lineto,$linefrom) = ('','');
        for (split // , $speedwalks{$_})
        {
                $lineto .= "$_;";
                $linefrom = "$inverts{$_};$linefrom"
        }
        chop $lineto; chop $linefrom;

        P::alias {$Common::speedwalk = (-1 + length $lineto) / 2; Common::eparser "$lineto" } "+$from$to";
        P::alias {$Common::speedwalk = (-1 + length $linefrom)/ 2; Common::eparser "$linefrom" } "+$to$from";

        my $vat = $_;
        P::alias
        {
                my $sw = $vat;
                $cur_pos = 0;
                @speed_array = split // , $speedwalks{$sw};
        } "?$from$to";

        P::alias
        {
                my $sw = $vat;
                @speed_array = reverse split // , $speedwalks{$sw};
                $_ = $inverts{$_} for @speed_array;
                $cur_pos = 0;
        } "?$to$from";
}


sub speedwalk_forward
{
        return P::echo "\3Ispeedwalk is empty" if $cur_pos >= scalar @speed_array;
        Common::sparser "$translate{$speed_array[$cur_pos]}"; 
        $cur_pos++;

}
sub speedwalk_backward
{
        return P::echo "\3Ispeedwalk is empty" if $cur_pos < 1;
        --$cur_pos;
        Common::sparser "$edirs{ $translate{ $speed_array[$cur_pos] } }";

}
P::bindkey { speedwalk_forward } $Alias::values{bind_speedw_fwd};
P::bindkey { speedwalk_backward } $Alias::values{bind_speedw_bck};


1;
